{
   "total":16,
   "data":[
      {
         "states":"TX",
         "latLong":"lat:35.5819662, long:-101.6717008",
         "description":"13,000 years ago this site was already well-known by mammoth hunters as a place to get the best stone for their tools. Centuries passed but the colorful flint found right here in the Texas panhandle never lost its value and usefulness. Visit and gain a sense of how integral this site was to the survival, commerce and culture of the High Plains.",
         "designation":"National Monument",
         "parkCode":"alfl",
         "id":"6D82D070-995A-4524-A56E-C1CE182E7D9B",
         "directionsInfo":"Alibates Flint Quarries is located approximately 35 miles north of Amarillo, Texas. From I-40 in Amarillo, take Lakeside exit north towards Lake Meredith National Recreation Area. Exit on TX 136 north towards Borger. After about 30 miles, turn west from TX 136 onto Cas Johnson Road. Park Service signs will be visible. Proceed approximately 3 miles to \"Y\" intersection and bear to right. Go northwest approximately 2 miles to the Alibates Flint Quarries National Monument Visitor Center.",
         "directionsUrl":"http://www.nps.gov/alfl/planyourvisit/directions.htm",
         "fullName":"Alibates Flint Quarries National Monument",
         "url":"https://www.nps.gov/alfl/index.htm",
         "weatherInfo":"The Texas Panhandle experiences a wide variety of weather conditions throughout the year. Winters are cold and windy, and summers are hot and dry. It is usually a good idea to bring a jacket with you if you are planning on hiking to the quarries with a ranger because the mesa gets very windy, even in the summer.",
         "name":"Alibates Flint Quarries"
      },
      {
         "states":"TX",
         "latLong":"lat:29.53539777, long:-101.075821",
         "description":"An oasis in the desert, Amistad National Recreation Area consists of the US portion of the International Amistad Reservoir. Amistad, whose name comes from the Spanish word meaning friendship, is best known for excellent water-based recreation, camping, hiking, rock art viewing, and its rich cultural history. Amistad is also home to a wide variety of plant and animal life above and below the water.",
         "designation":"National Recreation Area",
         "parkCode":"amis",
         "id":"34CB30BA-8A5F-4563-AA34-6633708DD9DC",
         "directionsInfo":"Six miles west of the HWY 90 and 277 North intersection.",
         "directionsUrl":"https://www.nps.gov/amis/planyourvisit/directions.htm",
         "fullName":"Amistad National Recreation Area",
         "url":"https://www.nps.gov/amis/index.htm",
         "weatherInfo":"Weather in Southwest Texas can change in a matter of minutes. It is best to check the local weather report. \nAmistad National Recreation Area usually has hot summers and mild winters.",
         "name":"Amistad"
      },
      {
         "states":"TX",
         "latLong":"lat:29.29817767, long:-103.2297897",
         "description":"There is a place in Far West Texas where night skies are dark as coal and rivers carve temple-like canyons in ancient limestone. Here, at the end of the road, hundreds of bird species take refuge in a solitary mountain range surrounded by weather-beaten desert. Tenacious cactus bloom in sublime southwestern sun, and diversity of species is the best in the country. This magical place is Big Bend.",
         "designation":"National Park",
         "parkCode":"bibe",
         "id":"C9056F71-7162-4208-8AE9-2D0AEFA594FD",
         "directionsInfo":"Hwy 118 south from Alpine; Hwy 385 south from Marathon; FM 170 from Presidio through Study Butte.",
         "directionsUrl":"http://www.nps.gov/bibe/planyourvisit/directions.htm",
         "fullName":"Big Bend National Park",
         "url":"https://www.nps.gov/bibe/index.htm",
         "weatherInfo":"Variable\n-- February through April often pleasant and comfortable temperatures.\n-- May through August is hot and can be stormy. Temperatures can reach well over 100 degrees in the lower elevations and along the river.\n-- September through January - . Temperatures are cooler; the weather can turn cold any time during these months.",
         "name":"Big Bend"
      },
      {
         "states":"TX",
         "latLong":"lat:30.42356654, long:-94.3384557",
         "description":"Life of all types abounds in the Big Thicket. This national preserve protects the incredible diversity of life found where multiple habitats converge in southeast Texas. Hiking trails and waterways meander through nine different ecosystems, from longleaf pine forests to cypress-lined bayous. It is a place of discovery, a place to wander and explore, a place to marvel at the richness of nature.",
         "designation":"National Preserve",
         "parkCode":"bith",
         "id":"3AA12AD8-4FEB-491D-AEB2-CC0F74CD00E0",
         "directionsInfo":"Big Thicket National Preserve consists of 15 units spread across 7 counties. The visitor center is located approximately 30 miles north of Beaumont, and 8 miles north of Kountze, along US 69/287.",
         "directionsUrl":"http://www.nps.gov/bith/planyourvisit/directions.htm",
         "fullName":"Big Thicket National Preserve",
         "url":"https://www.nps.gov/bith/index.htm",
         "weatherInfo":"Big Thicket National Preserve is generally very hot and humid during the spring and summer. Winters are mild. Snow and subfreezing temperatures are uncommon.",
         "name":"Big Thicket"
      },
      {
         "states":"TX",
         "latLong":"lat:31.76729634, long:-106.4544011",
         "description":"Chamizal is more than just an urban park to recreate or enjoy a quiet afternoon. These grounds are a reminder of the harmonious settlement of a 100-year border dispute between the United States and Mexico. We celebrate the cultures of the borderlands to promote the same mutual respect that helped to diplomatically resolve an international disagreement.",
         "designation":"National Memorial",
         "parkCode":"cham",
         "id":"EA328EBD-71CC-49B9-8F64-97C8A188BCA4",
         "directionsInfo":"From the west take exit 21 off of I-10 toward Piedras Street. Turn right onto Piedras and follow it to Paisano Drive. Turn left onto Paisano and then turn right onto San Marcial Street. From the north take exit 20A off of US-54 for US-62 toward Paisano Drive. Turn right onto Paisano and follow it until you reach San Marcial Street. From the east take exit 22B on I-10 toward US-54. Stay left until two lanes merge, move into the right lane toward Paisano Drive. Turn right at the light and merge onto Paisano.",
         "directionsUrl":"http://www.nps.gov/cham/planyourvisit/directions.htm",
         "fullName":"Chamizal National Memorial",
         "url":"https://www.nps.gov/cham/index.htm",
         "weatherInfo":"Chamizal National Memorial is open year-round, but periodic winter weather conditions may cause closure. Please check for alerts on the park website: www.nps.gov/cham. Thunderstorms typically occur during summer and early fall. There may be no shelter to avoid lightning, so please prepare by looking at weather forecasts and paying attention to developing weather conditions.",
         "name":"Chamizal"
      },
      {
         "states":"TX,LA",
         "latLong":"",
         "description":"Come on a journey that will carry you through 300 years of Louisiana and Texas frontier settlement and development on a Spanish colonial \"royal road\" that originally extended to Mexico City, Mexico.",
         "designation":"National Historic Trail",
         "parkCode":"elte",
         "id":"111711AC-B056-4CCF-B08F-35EE0E313CF4",
         "directionsInfo":"El Camino Real includes a wide variety of sites and organizations. Please view the site-specific directions organized by state and site at Places To Go or Passport Program. www.nps.gov/elte/planyourvisit/placestogo.htm \n\nPlane: You can reach the national historic trail by flying into a number of airports, including Laredo and San Antonio, Texas, and Alexandria, Louisiana.",
         "directionsUrl":"http://www.nps.gov/elte/planyourvisit/directions.htm",
         "fullName":"El Camino Real de los Tejas National Historic Trail",
         "url":"https://www.nps.gov/elte/index.htm",
         "weatherInfo":"Due to the length of El Camino de los Tejas National Historic Trail, be sure to consult local weather sources for the region you'll be visiting. Here's a link to the South Central US:\n\nwww.accuweather.com/en/us/south-central/weather-radar",
         "name":"El Camino Real de los Tejas"
      },
      {
         "states":"NM,TX",
         "latLong":"",
         "description":"Take a journey on El Camino Real de Tierra Adentro National Historic Trail to savor 300 years of heritage and culture in the Southwest. This Spanish colonial \"royal road\" in New Mexico and Texas originally extended to Mexico City, Mexico.",
         "designation":"National Historic Trail",
         "parkCode":"elca",
         "id":"2EE542B6-3806-4E9C-ABBD-C4CC4C7E97C7",
         "directionsInfo":"Plane:  You can reach the national historic trail by flying into a number of airports, including Santa Fe and Albuquerque, New Mexico, and El Paso, Texas.\n\nCar:  You can reach most trail sites by auto along the I-25 corridor. Some sites are along unpaved roads.\n\nGo to the Places to Go web page for specific site addresses.  http://www.nps.gov/elca/planyourvisit/places-to-go.htm",
         "directionsUrl":"http://www.nps.gov/elca/planyourvisit/directions.htm",
         "fullName":"El Camino Real de Tierra Adentro National Historic Trail",
         "url":"https://www.nps.gov/elca/index.htm",
         "weatherInfo":"Due to the length of El Camino Real de Tierra Adentro National Historic Trail, be sure to consult local weather sources for the region you'll be visiting. Here is a link for the Southwest US.\n\nwww.accuweather.com/en/us/southwest-region/weather-radar",
         "name":"El Camino Real de Tierra Adentro"
      },
      {
         "states":"TX",
         "latLong":"lat:30.59930381, long:-103.8961904",
         "description":"Fort Davis is one of the best surviving examples of an Indian Wars' frontier military post in the Southwest. From 1854 to 1891, Fort Davis was strategically located to protect emigrants, mail coaches, and freight wagons on the Trans-Pecos portion of the San Antonio-El Paso Road and on the Chihuahua Trail.",
         "designation":"National Historic Site",
         "parkCode":"foda",
         "id":"DE70B987-01A4-4BA5-9662-030BE3329AB3",
         "directionsInfo":"We are approximately 2.5 hours south of Midland/Odessa starting on I-20 to HWY 17, 3.5 hours North West of Del Rio starting on HWY 90 to HWY 118, 4 hours east of El Paso starting on I-10 to HWY 118 and 7 hours west of San Antonio starting on I-10 to HWY 17.",
         "directionsUrl":"http://www.nps.gov/foda/planyourvisit/directions.htm",
         "fullName":"Fort Davis National Historic Site",
         "url":"https://www.nps.gov/foda/index.htm",
         "weatherInfo":"Summer Temperatures average a High of 95 and low of 65. Winter Temperatures average a High of 60 and a low of 20.  Wind is very common and heavy rainfall is very sporadic.",
         "name":"Fort Davis"
      },
      {
         "states":"TX",
         "latLong":"lat:31.92304462, long:-104.885527",
         "description":"Guadalupe Mountains National Park protects the world's most extensive Permian fossil reef, the four highest peaks in Texas, an environmentally diverse collection of flora and fauna, and the stories of lives shaped through conflict, cooperation and survival. Come experience mountains and canyons, desert and dunes, night skies and spectacular vistas within a place unlike any other within the NPS.",
         "designation":"National Park",
         "parkCode":"gumo",
         "id":"6510001B-685D-4688-A963-4ECE7AB609DB",
         "directionsInfo":"Guadalupe Mountains National Park is located on the north side of US Hwy 62/180. \nIf you are traveling east from El Paso, TX, we are 110 miles East of the city. Follow US Hwy 62/180 North to the Pine Springs Visitor Center. \nIf you are traveling from Van Horn, TX, you will travel north on US 54 and make a left hand turn at the junction of US 62/180 to arrive at the park.\nIf you are traveling west from Carlsbad, NM, you will travel on US Hwy 62/180 South and cross into Texas. Follow signs to the park.",
         "directionsUrl":"http://www.nps.gov/gumo/planyourvisit/directions.htm",
         "fullName":"Guadalupe Mountains National Park",
         "url":"https://www.nps.gov/gumo/index.htm",
         "weatherInfo":"Weather in the Guadalupe Mountains can change in an instant. In the Spring and Summer, average temperatures vary with highs between 70F-80F+ with evening lows in the 40F-60F range. The Fall and Winter bring milder temperatures with highs in between 50F-60F with evening lows in the 30F-50F range.",
         "name":"Guadalupe Mountains"
      },
      {
         "states":"TX",
         "latLong":"lat:35.61926203, long:-101.6820066",
         "description":"Within the dry and windswept high plains of the Texas Panhandle lies a hidden oasis, a welcoming haven where wildlife and humans find respite from the dry grasslands above. Through this plain, the Canadian River has cut dramatic 200-foot canyons, or breaks, where humans have eked out a living for over 13,000 years. Lake Meredith now occupies these hidden coves where early humans once roamed.",
         "designation":"National Recreation Area",
         "parkCode":"lamr",
         "id":"AC3B46AA-B4C2-4555-A82A-D4CF790DF81D",
         "directionsInfo":"There are several different ways to get to Lake Meredith. If you are coming from Amarillo, exit Loop 335 North, then exit Hwy 136 North to Fritch. Headquarters is located at 419 E. Broadway in Fritch. If coming from the North you can take 1913 from the Dumas Highway or 1913 from US 287.\n\nThe airport in Amarillo is approximately 35 miles south of Lake Meredith if traveling by air. Rental cars are available.",
         "directionsUrl":"http://www.nps.gov/lamr/planyourvisit/directions.htm",
         "fullName":"Lake Meredith National Recreation Area",
         "url":"https://www.nps.gov/lamr/index.htm",
         "weatherInfo":"The Texas Panhandle experiences a wide variety of weather conditions throughout the year. Winters are cold and windy, and summers are hot and dry. It is usually a good idea to bring a jacket with you because the region gets very windy, even in the summer.",
         "name":"Lake Meredith"
      },
      {
         "states":"TX",
         "latLong":"lat:30.2519655, long:-98.60692433",
         "description":"---Lyndon Baines Johnson\n\nLyndon B. Johnson National Historical Park tells the story of our 36th President beginning with his ancestors until his final resting place on his beloved LBJ Ranch. This entire \"circle of life\" gives the visitor a unique perspective into one of America's most noteworthy citizens by providing the most complete picture of any American president.",
         "designation":"National Historical Park",
         "parkCode":"lyjo",
         "id":"ECDFABE2-6448-46EA-886E-FE79ACBBF16E",
         "directionsInfo":"By car to National Park Headquarters and the Visitor Center in Johnson City:\n\nFrom Austin, take Highway 290 west.\nFrom San Antonio, take Highway 281 north.\nFrom Fredericksburg, take Highway 290 east. \n\nBy car to the LBJ Ranch and LBJ State Park and Historic Site:\n\nFrom Johnson City, take Highway 290 fourteen miles west to the LBJ State Park.\nFrom Fredericksburg, take Highway 290 sixteen miles east to the LBJ State Park.\n\nThe nearest major airports are in Austin and San Antonio.",
         "directionsUrl":"http://www.nps.gov/lyjo/planyourvisit/directions.htm",
         "fullName":"Lyndon B Johnson National Historical Park",
         "url":"https://www.nps.gov/lyjo/index.htm",
         "weatherInfo":"Overall, the park enjoys a sunny, mild climate during three seasons of the year.\n\nSpring: Temperatures range from 45 F to 85 F (7 C/29 C). Rain is common in April and May.\n\nSummer: Temperatures range from 70 F to 95 F (21 C/35 C). Temperatures can exceed 100 F (38 C) in July and August. Lightweight clothing and sunscreen are advisable. Be prepared with plenty of water.\n\nFall: Temperatures range from 45 F to 85 F (7 C/29 C).\n\nWinter: Temperatures range from 35 F to 65 F (2 C/18 C) . Snow and ice are rare.",
         "name":"Lyndon B Johnson"
      },
      {
         "states":"TX",
         "latLong":"lat:27.05381186, long:-97.35901135",
         "description":"Padre Island National Seashore separates the Gulf of Mexico from the Laguna Madre, one of a few hypersaline lagoons in the world.  The park protects 70 miles of coastline, dunes, prairies, and wind tidal flats teeming with life.  It is a safe nesting ground for the Kemp’s ridley sea turtle and a haven for over 380 bird species.  It also has a rich history, including the Spanish shipwrecks of 1554.",
         "designation":"National Seashore",
         "parkCode":"pais",
         "id":"7F7E12D2-E295-41D2-8446-BBF5EEF2F8F2",
         "directionsInfo":"The National Seashore is located on North Padre Island, southeast of the city of Corpus Christi, Texas. Visitors to the area should head east through Corpus Christi on Highway 358. After crossing the JFK Causeway onto Padre Island, Highway 358 changes to Park Road 22. Continue about 10 miles south on Park Road 22 to reach the park entrance.",
         "directionsUrl":"http://www.nps.gov/pais/planyourvisit/directions.htm",
         "fullName":"Padre Island National Seashore",
         "url":"https://www.nps.gov/pais/index.htm",
         "weatherInfo":"Padre Island has long, hot summers and short, mild winters. Summers are very humid. Winter can bring strong cold fronts and gale force winds. Most rain falls near the beginning and end of hurricane season (June-October). Average seasonal temperatures (Fahrenheit) are: Spring - high 70s-80s, low 50s-60s; Summer - high mid-90s, low 70s; Fall - high 70s-80s, low 50s-60s; Winter - high 50s-70s, low 30s-40s. Year-round, average wind speed ranges from 5-25 miles per hour. Relative humidity seldom drops below 70%.",
         "name":"Padre Island"
      },
      {
         "states":"TX",
         "latLong":"lat:26.02387351, long:-97.46296072",
         "description":"On May 8, 1846, United States and Mexican troops clashed on the prairie of Palo Alto. The battle was the first in a two-year long war that changed the map of North America. Palo Alto Battlefield National Historical Park preserves the site of this notable battle and provides an understanding of the causes, events, and consequences of the U.S.-Mexican War.",
         "designation":"National Historical Park",
         "parkCode":"paal",
         "id":"3E8C5A4D-6302-4E50-9FCC-A9EC7BFBF1D6",
         "directionsInfo":"The park is located on Brownsville's north side, near the city of Los Fresnos. It is just north of the intersection of FM 1847 (Paredes Line Rd.) and FM 511/FM 550.",
         "directionsUrl":"http://www.nps.gov/paal/planyourvisit/directions.htm",
         "fullName":"Palo Alto Battlefield National Historical Park",
         "url":"https://www.nps.gov/paal/index.htm",
         "weatherInfo":"Summers are hot and humid. Tropical weather systems generally affect the area from August to October. Winters are usually mild but cold fronts can drop temperatures by up to 30 degrees in about an hour.",
         "name":"Palo Alto Battlefield"
      },
      {
         "states":"TX",
         "latLong":"lat:29.52743158, long:-102.5979169",
         "description":"It is an irresistible playground where unruly rapids check your skills as a canyon wren’s definitive call cascades down ancient limestone cliffs. Below the chasm, the canyon’s raw beauty dances across mirrored water. While the primal nature of the river stirs hunger for spirited adventure, the river is also an undulant ribbon of wetland corridor and, against all odds, the lifeblood of the desert.",
         "designation":"Wild & Scenic River",
         "parkCode":"rigr",
         "id":"E1A636E5-E7AC-4B71-93DE-F1408F65C458",
         "directionsInfo":"Hwy 118 south from Alpine; Hwy 385 south from Marathon; FM 170 from Presidio through Study Butte.",
         "directionsUrl":"http://www.nps.gov/rigr/planyourvisit/directions.htm",
         "fullName":"Rio Grande Wild & Scenic River",
         "url":"https://www.nps.gov/rigr/index.htm",
         "weatherInfo":"Variable\n-- February-April: High temperatures range from mid-70sF (23C) to low-90sF (32C) with lows from the mid-30sF (2C) to mid-50sF (12C). Cold fronts can bring freezing weather with rain or snow.\n-- May-August: Temperatures are hot and the weather can be stormy. Temperatures over 100F (more than 38C) degrees.\n-- September-January:Temperatures are cooler. The weather can turn cold any time during these months.",
         "name":"Rio Grande"
      },
      {
         "states":"TX",
         "latLong":"lat:29.31262089, long:-98.4289522",
         "description":"After 10,000 years, the people of South Texas found their cultures, their very lives under attack. In the early 1700s Apache raided from the north, deadly diseases traveled from Mexico, and drought lingered. Survival lay in the missions. By entering a mission, they foreswore their traditional life to become Spanish, accepting a new religion and pledging fealty to a distant and unseen king.",
         "designation":"National Historical Park",
         "parkCode":"saan",
         "id":"CCE1AD17-9B13-4D74-9CAC-0278D5477316",
         "directionsInfo":"Park Headquarter's is located 4 miles south of downtown San Antonio.\nThe four mission sites lay as a chain south of downtown. Mission Concepción is 3 miles, Mission San José and the park visitor center is 6 miles south, Mission San Juan is 3 miles south of San José, and Mission Espada lays another mile beyond. \nWritten directions and GPS addresses can be found at the link below.",
         "directionsUrl":"http://www.nps.gov/saan/planyourvisit/directions.htm",
         "fullName":"San Antonio Missions National Historical Park",
         "url":"https://www.nps.gov/saan/index.htm",
         "weatherInfo":"Over the course of a year, the temperature typically varies from 40°F to 95°F and is rarely below 29°F or above 100°F. The warm season lasts from May through September with an average daily high temperature above 90°F and a low of 75°F. The cold season lasts from November through February with an average daily high below 68°F and an average low of 40°F.\nThe relative humidity ranges from 40-80% over the course of the year, which can be very uncomfortable to many people.",
         "name":"San Antonio Missions"
      },
      {
         "states":"TX",
         "latLong":"lat:31.60465887, long:-97.17606143",
         "description":"On July 10, 2015, President Barack Obama issued a Presidential Proclamation making the Waco Mammoth Site a new unit of the National Park System. This paleontological site represents the nation’s only recorded discovery of a nursery herd of Columbian mammoths. Visitors can view \"in situ\" fossils including female mammoths, a bull mammoth, and a camel that lived approximately 67,000 years ago.",
         "designation":"National Monument",
         "parkCode":"waco",
         "id":"46CA5FAF-2AEE-4795-B609-8CB81F9FBBEC",
         "directionsInfo":"From I-35 North, take exit 339 and head west on Lake Shore Drive. Turn right on Steinbeck Bend Drive and travel 1.5 miles to the Monument.\n\nFrom I-35 South, take exit 335C and head northwest on Martin Luther King, Jr. Boulevard. Continue straight onto Steinbeck Bend Drive and travel 1.5 miles to the Monument.\n\nThe Monument is easily accessible via personal vehicle, bus, or motor home.",
         "directionsUrl":"http://www.nps.gov/waco/planyourvisit/directions.htm",
         "fullName":"Waco Mammoth National Monument",
         "url":"https://www.nps.gov/waco/index.htm",
         "weatherInfo":"Overall, the monume enjoys a sunny, mild climate during three seasons of the year.\n\nSpring: Temperatures range from 45 F to 85 F (7 C/29 C). Rain is common in April and May.\n\nSummer: Temperatures range from 70 F to 95 F (21 C/35 C). Temperatures can exceed 100 F (38 C) in July and August. Lightweight clothing and sunscreen are advisable. Be prepared with plenty of water.\n\nFall: Temperatures range from 45 F to 85 F (7 C/29 C).\n\nWinter: Temperatures range from 35 F to 65 F (2 C/18 C) . Snow and ice are rare.",
         "name":"Waco Mammoth"
      }
   ],
   "limit":50.0,
   "start":1.0
}
